{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Hey",
        "Greetings",
        "What's up",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "Howdy",
        "Hi there"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! How can I help you?",
        "Greetings! What can I do for you today?",
        "Hey! Need any assistance with web design or development?",
        "Hello! How may I help you today?"
      ]
    },
    {
      "tag": "introduce_chatbot",
      "patterns": [
        "What is your name?",
        "Who are you?",
        "Tell me your name",
        "Introduce yourself",
        "What should I call you?",
        "Do you have a name?",
        "Who am I chatting with?",
        "What's your name?"
      ],
      "responses": [
        "I'm WebAssist, your friendly chatbot here to help with any web design and development inquiries.",
        "You can call me WebAssist. I'm here to assist you with web services.",
        "I'm WebAssist, your virtual assistant for web-related services.",
        "My name is WebAssist. How can I assist you today?",
        "I'm WebAssist, your dedicated chatbot for web design and development support."
      ]
    },
    {
      "tag": "user_name",
      "patterns": [
        "My name is [name]",
        "I am [name]",
        "You can call me [name]",
        "I'm [name]",
        "Hello, I'm [name]",
        "Hi, I'm [name]",
        "Hey, I'm [name]"
      ],
      "responses": [
        "Nice to meet you, [name]! How can I assist you today?",
        "Hello [name], how can I help you with your web design or development needs?",
        "Hi [name]! What can I do for you today?",
        "Greetings [name]! How may I assist you today?",
        "Hey [name]! Need any assistance with web services?"
      ]
    },
    {
      "tag": "general_info",
      "patterns": [
        "What does your company do?",
        "Tell me about your company.",
        "What services do you provide?",
        "Describe your company.",
        "What is your business about?",
        "What do you specialize in?",
        "What are your main services?",
        "What solutions do you offer?",
        "What is your expertise?",
        "Can you explain what your company does?"
      ],
      "responses": [
        "We specialize in website design and development, providing customized solutions to meet your business needs.",
        "Our company offers professional website design and development services to help businesses establish a strong online presence.",
        "We create high-quality, responsive, and user-friendly websites tailored to your business goals.",
        "Our expertise lies in developing customized websites that enhance user experience and drive engagement.",
        "We provide a range of web design and development services, including e-commerce solutions, SEO optimization, and website maintenance."
      ]
    },
    {
      "tag": "services",
      "patterns": [
        "What services do you offer?",
        "List your services.",
        "What kind of services are available?",
        "Do you offer custom website design?",
        "Can you tell me about your services?",
        "What services are included?",
        "What can you do for my website?",
        "What are the services you provide?",
        "What web services do you offer?",
        "Do you provide web development services?",
        "What web design services do you have?",
        "Do you offer SEO services?",
        "Do you provide e-commerce solutions?",
        "Can you help with website maintenance?",
        "What type of web solutions do you offer?"
      ],
      "responses": [
        "We offer website design, website development, e-commerce solutions, SEO optimization, website maintenance, and more.",
        "Our services include custom website design, responsive web development, and ongoing maintenance.",
        "We provide a full range of web services including SEO, e-commerce setup, and site optimization.",
        "Yes, we create custom website designs tailored to your brand and business objectives.",
        "Our offerings include web design, development, e-commerce solutions, SEO, and website maintenance.",
        "We specialize in creating responsive and user-friendly websites, optimizing them for search engines, and providing continuous support.",
        "We offer comprehensive web development services to meet all your online needs, from design to deployment."
      ]
    },
    {
      "tag": "pricing",
      "patterns": [
        "How much does a website design cost?",
        "What are your prices?",
        "Do you offer any packages?",
        "What is the cost of your services?",
        "How do you charge for web design?",
        "Can you give me a quote?",
        "What are your rates?",
        "How much do you charge for a website?",
        "What are your pricing options?",
        "Do you have pricing plans?",
        "How much does it cost to develop a website?",
        "What is your pricing structure?",
        "How much will a custom website cost?",
        "What do you charge for web development?",
        "Can you provide pricing details?"
      ],
      "responses": [
        "Our pricing varies depending on the complexity and requirements of the project. Contact us for a detailed quote.",
        "We offer several packages to fit different needs and budgets. Please visit our pricing page for more details.",
        "The cost of our services depends on the scope of the project. We can provide a customized quote based on your requirements.",
        "Our rates are competitive and tailored to the specific needs of each project. Contact us to discuss your project and get a quote.",
        "We have flexible pricing plans to accommodate various budgets. Reach out to us for more information."
      ]
    },
    {
      "tag": "process",
      "patterns": [
        "What is your design and development process?",
        "How do you design websites?",
        "What is your web development process?",
        "Can you explain your process?",
        "How do you work on a project?",
        "What are the steps in your process?",
        "What is your workflow?",
        "How do you approach website design?",
        "What are the stages of your process?",
        "What is the timeline for your process?",
        "How do you handle web development projects?",
        "What is your method for website creation?",
        "Can you describe your project process?",
        "How do you manage design projects?",
        "What is your approach to web development?"
      ],
      "responses": [
        "Our process includes discovery, planning, design, development, testing, and launch. We work closely with you at each stage to ensure your satisfaction.",
        "We follow a structured process: initial consultation, project planning, design phase, development, testing, and final launch.",
        "Our approach involves understanding your needs, designing a prototype, developing the website, rigorous testing, and then launching it.",
        "We start with gathering requirements, move on to design and development, and finish with testing and deployment.",
        "Our workflow ensures a collaborative process, involving you at every key stage to make sure we meet your expectations."
      ]
    },
    {
      "tag": "timeline",
      "patterns": [
        "How long does it take to build a website?",
        "What is the timeline for web development?",
        "How long will my project take?",
        "What is the duration for a website design?",
        "How much time does it take to complete a website?",
        "What is your project timeline?",
        "How fast can you develop a website?",
        "What is the estimated time for web development?",
        "How long do you take to design a website?",
        "What is your project duration?",
        "How much time does your process take?",
        "How long does the development phase take?",
        "What is the timeline for a custom website?",
        "How soon can you complete a website?",
        "What is your estimated completion time?"
      ],
      "responses": [
        "The timeline depends on the project’s complexity. A typical website can take 4-8 weeks from start to finish.",
        "Most projects are completed within 4-8 weeks, depending on the specific requirements and scope of work.",
        "We aim to complete standard website projects within 6 weeks, though more complex sites may take longer.",
        "Our project duration varies, but a standard website typically takes around 1-2 months to design and develop.",
        "The time required depends on your project’s complexity. We will provide a detailed timeline after assessing your needs."
      ]
    },
    {
      "tag": "support",
      "patterns": [
        "Do you offer post-launch support?",
        "What happens if my website has an issue?",
        "Do you provide maintenance services?",
        "Can I get support after the website is live?",
        "What if I need help after launch?",
        "Do you offer ongoing maintenance?",
        "What kind of support do you offer?",
        "Can you help with website issues?",
        "Is there post-launch assistance?",
        "Do you support your websites after launch?",
        "What maintenance services do you provide?",
        "How do you handle website problems?",
        "What is your support policy?",
        "Do you offer technical support?",
        "Can I get help with my website post-launch?"
      ],
      "responses": [
        "Yes, we provide ongoing maintenance and support to ensure your website runs smoothly.",
        "You can contact our support team, and we will resolve any issues as quickly as possible.",
        "We offer a range of maintenance services, including regular updates, security checks, and troubleshooting.",
        "Our post-launch support ensures your website remains up-to-date and secure, with assistance available whenever needed.",
        "We are committed to supporting your website post-launch and offer various maintenance packages to keep it running optimally."
      ]
    },
    {
      "tag": "portfolio",
      "patterns": [
        "Can I see some examples of your work?",
        "Do you have a portfolio?",
        "Show me your previous projects.",
        "Can you share your portfolio?",
        "Where can I see your past work?",
        "Do you have any samples?",
        "Can I view your work?",
        "What projects have you done?",
        "Do you have a project gallery?",
        "Can I check your previous designs?",
        "Show me some of your completed projects.",
        "Do you have examples of your work?",
        "Can I see your design portfolio?",
        "Where can I find your work samples?",
        "Can you provide links to your past projects?"
      ],
      "responses": [
        "Sure, please visit our portfolio page to see some of the websites we have designed and developed.",
        "You can view our portfolio on our website, showcasing a variety of projects we have completed.",
        "Our portfolio page features examples of our work. Please take a look to see the quality of our designs.",
        "We have a comprehensive portfolio available on our website, displaying our previous projects and client work.",
        "Check out our portfolio to see the diverse range of websites we have developed for various clients."
      ]
    },
    {
      "tag": "experience",
      "patterns": [
        "How experienced is your team?",
        "Tell me about your team's experience.",
        "What is your team's background?",
        "How long have you been in business?",
        "What is your experience in web design?",
        "How experienced are your developers?",
        "Do you have experienced designers?",
        "What is your team's expertise?",
        "How skilled is your team?",
        "What is your experience level?",
        "Can you tell me about your experience?",
        "How many years of experience do you have?",
        "What are your qualifications?",
        "How long have you been designing websites?",
        "What is your professional background?"
      ],
      "responses": [
        "Our team has over 10 years of experience in web design and development, working with clients from various industries.",
        "We have a highly skilled team with extensive experience in creating custom websites tailored to business needs.",
        "Our designers and developers are industry experts with years of experience in delivering high-quality web solutions.",
        "With over a decade in the industry, our team has successfully completed numerous projects for diverse clients.",
        "Our experienced team brings a wealth of knowledge and expertise to every project, ensuring exceptional results."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I get in touch with you?",
        "What is your contact information?",
        "Where are you located?",
        "How do I contact your company?",
        "Can I call you?",
        "What is your phone number?",
        "Do you have an email address?",
        "How do I reach you?",
        "What is your address?",
        "Where can I find you?",
        "Can I visit your office?",
        "How can I send you a message?",
        "What is your location?",
        "Where is your company based?",
        "What is the best way to contact you?"
      ],
      "responses": [
        "You can contact us via email at [email@example.com], or call us at [phone number]. Alternatively, you can fill out the contact form on our website.",
        "We are located in [City, Country], but we serve clients worldwide. Reach us by email or phone for more information.",
        "Feel free to email us at [email@example.com] or call us at [phone number]. We are also available through our website’s contact form.",
        "Our office is in [City, Country]. You can contact us via email, phone, or through our website for any inquiries.",
        "You can get in touch with us by emailing [email@example.com], calling [phone number], or visiting our office at [address]."
      ]
    },
    {
      "tag": "technologies",
      "patterns": [
        "What technologies do you use?",
        "Do you use WordPress?",
        "What platforms do you work with?",
        "What coding languages do you use?",
        "Do you develop with HTML5?",
        "Do you use JavaScript?",
        "What CMS platforms do you support?",
        "Do you use React or Angular?",
        "Can you build e-commerce sites with Shopify?",
        "What frameworks do you use?",
        "Do you work with PHP?",
        "What are your development tools?",
        "Do you use any specific software?",
        "What databases do you use?",
        "Do you work with cloud platforms?"
      ],
      "responses": [
        "We use a variety of technologies including HTML5, CSS3, JavaScript, PHP, and frameworks like React and Angular.",
        "Yes, we work with popular CMS platforms like WordPress, Joomla, and Drupal.",
        "Our development stack includes HTML5, CSS3, JavaScript, PHP, and frameworks such as React, Angular, and Vue.js.",
        "We support e-commerce platforms like Shopify, WooCommerce, and Magento.",
        "Our team is proficient in using modern technologies and tools to deliver high-quality web solutions."
      ]
    },
    {
      "tag": "ecommerce",
      "patterns": [
        "Do you develop e-commerce websites?",
        "Can you create an online store?",
        "Do you work with Shopify?",
        "What e-commerce solutions do you offer?",
        "Can you build a WooCommerce site?",
        "Do you offer Magento development?",
        "Can you help with setting up an online shop?",
        "What e-commerce platforms do you support?",
        "Can you integrate payment gateways?",
        "Do you develop custom e-commerce solutions?",
        "Can you create a shopping cart system?",
        "Do you provide support for online stores?",
        "Can you design product pages?",
        "Do you offer e-commerce site maintenance?",
        "Can you develop multi-vendor marketplaces?"
      ],
      "responses": [
        "Yes, we develop e-commerce websites using platforms like Shopify, WooCommerce, and Magento.",
        "We can create a fully functional online store tailored to your specific business needs.",
        "Our e-commerce solutions include custom design, product page development, shopping cart integration, and payment gateway setup.",
        "We support various e-commerce platforms and offer custom development to enhance your online store.",
        "Our team provides ongoing support and maintenance for e-commerce websites to ensure smooth operation."
      ]
    },
    {
      "tag": "seo",
      "patterns": [
        "Do you offer SEO services?",
        "Can you help improve my site's ranking?",
        "Do you provide on-page SEO?",
        "What SEO services do you offer?",
        "Can you optimize my website for search engines?",
        "Do you do keyword research?",
        "Can you help with local SEO?",
        "Do you offer technical SEO?",
        "Can you improve my site's speed for SEO?",
        "Do you provide SEO audits?",
        "Can you help with backlink building?",
        "Do you optimize content for SEO?",
        "What SEO strategies do you use?",
        "Do you offer SEO consulting?",
        "Can you monitor my site's SEO performance?"
      ],
      "responses": [
        "Yes, we offer comprehensive SEO services to improve your website's visibility and ranking on search engines.",
        "Our SEO services include on-page optimization, keyword research, technical SEO, and content optimization.",
        "We can help improve your site's ranking with tailored SEO strategies and ongoing performance monitoring.",
        "Our team provides SEO audits, backlink building, local SEO, and site speed optimization to enhance your online presence.",
        "We offer both on-page and off-page SEO services to ensure your website is fully optimized for search engines."
      ]
    },
    {
      "tag": "responsive_design",
      "patterns": [
        "Do you create responsive websites?",
        "Can you make my site mobile-friendly?",
        "Do you design for mobile devices?",
        "What is responsive design?",
        "Can you ensure my site looks good on all devices?",
        "Do you offer mobile optimization?",
        "Can you create a responsive layout?",
        "Do you develop sites that work on tablets?",
        "Is your web design mobile-first?",
        "Can you make my website responsive?",
        "Do you support responsive web design?",
        "What is a responsive website?",
        "Can you optimize my site for mobile?",
        "Do you design for all screen sizes?",
        "Can you ensure my site is user-friendly on mobile?"
      ],
      "responses": [
        "Yes, we create responsive websites that provide an optimal viewing experience across all devices.",
        "We ensure that your website looks great and functions smoothly on mobile devices, tablets, and desktops.",
        "Responsive design means that your website will automatically adjust its layout to fit the screen size of any device.",
        "Our team specializes in mobile-first design to ensure your site is fully optimized for mobile users.",
        "We develop responsive layouts that enhance user experience and accessibility on all screen sizes."
      ]
    },
    {
      "tag": "content_management",
      "patterns": [
        "Do you offer content management systems?",
        "Can you build a CMS for my site?",
        "What CMS platforms do you support?",
        "Do you use WordPress?",
        "Can you create a custom CMS?",
        "What content management systems do you recommend?",
        "Do you develop Joomla sites?",
        "Can you set up Drupal for my website?",
        "Do you provide CMS training?",
        "Can you integrate a CMS into my existing site?",
        "What are the benefits of a CMS?",
        "Can you help with CMS migration?",
        "Do you offer CMS customization?",
        "Can you maintain my CMS?",
        "What is a content management system?"
      ],
      "responses": [
        "Yes, we offer content management system (CMS) solutions to help you easily manage your website content.",
        "We support various CMS platforms including WordPress, Joomla, and Drupal.",
        "Our team can create a custom CMS tailored to your specific needs and preferences.",
        "We provide CMS integration, customization, and training to ensure you can effectively manage your site.",
        "A CMS allows you to easily update and manage your website content without needing technical expertise."
      ]
    },
    {
      "tag": "custom_design",
      "patterns": [
        "Do you offer custom website design?",
        "Can you create a unique design for my site?",
        "Do you provide bespoke web design?",
        "Can you design a custom website?",
        "What is custom web design?",
        "Do you create personalized web designs?",
        "Can you tailor the design to my brand?",
        "Do you offer unique website designs?",
        "Can you customize the design for my needs?",
        "What are your custom design services?",
        "Can you design a site from scratch?",
        "Do you offer tailor-made web design?",
        "Can you create a custom layout?",
        "What is bespoke web design?",
        "Can you provide a personalized design for my website?"
      ],
      "responses": [
        "Yes, we offer custom website design services to create a unique and personalized site that reflects your brand.",
        "We can design a bespoke website tailored to your specific needs and business goals.",
        "Our custom web design services ensure that your site stands out with a unique and tailored design.",
        "We specialize in creating personalized web designs that align with your brand identity and objectives.",
        "Our team provides custom design solutions to help your website achieve a distinctive and professional look."
      ]
    },
    {
      "tag": "site_optimization",
      "patterns": [
        "Can you optimize my website?",
        "Do you offer site optimization services?",
        "Can you improve my site's performance?",
        "What is website optimization?",
        "Do you optimize site speed?",
        "Can you help with page load times?",
        "Do you offer performance optimization?",
        "Can you optimize my site's images?",
        "Do you provide code optimization?",
        "Can you improve my site's usability?",
        "Do you offer mobile optimization?",
        "Can you enhance my site's accessibility?",
        "Do you optimize for user experience?",
        "Can you help with SEO optimization?",
        "Do you provide comprehensive site optimization?"
      ],
      "responses": [
        "Yes, we offer comprehensive website optimization services to improve performance, speed, and user experience.",
        "Our site optimization services include performance tuning, SEO, and usability enhancements.",
        "We can optimize your website's speed, ensuring fast page load times and a better user experience.",
        "Website optimization involves improving various aspects of your site to enhance performance and accessibility.",
        "Our team provides thorough optimization to ensure your website runs smoothly and efficiently across all devices."
      ]
    },
    {
      "tag": "website_redesign",
      "patterns": [
        "Can you redesign my website?",
        "Do you offer website redesign services?",
        "Can you update my current site?",
        "What is website redesign?",
        "Do you provide site makeover services?",
        "Can you revamp my website?",
        "Do you offer redesign for outdated sites?",
        "Can you help modernize my website?",
        "Do you offer complete site redesign?",
        "Can you improve the design of my site?",
        "Do you provide redesign for better usability?",
        "Can you update the look of my website?",
        "Do you offer aesthetic redesign services?",
        "Can you enhance my site's design?",
        "Do you provide redesign to improve user experience?"
      ],
      "responses": [
        "Yes, we offer website redesign services to give your site a fresh, modern look and improved functionality.",
        "We can update your current site with a new design that enhances usability and user experience.",
        "Our website redesign services involve a complete makeover to align your site with your brand's goals and aesthetics.",
        "We specialize in revamping outdated websites, improving both their appearance and performance.",
        "Our redesign process focuses on modernizing your website and ensuring it meets the latest web standards."
      ]
    },
    {
      "tag": "security",
      "patterns": [
        "Do you offer website security services?",
        "Can you secure my website?",
        "What security measures do you provide?",
        "Do you offer SSL certificates?",
        "Can you protect my site from hacking?",
        "Do you provide malware removal?",
        "What are your security solutions?",
        "Do you offer site security audits?",
        "Can you help with data protection?",
        "Do you offer secure hosting?",
        "Can you secure my e-commerce site?",
        "What security services do you offer?",
        "Do you provide website monitoring?",
        "Can you implement security protocols?",
        "Do you offer DDoS protection?"
      ],
      "responses": [
        "Yes, we offer comprehensive website security services to protect your site from threats and vulnerabilities.",
        "Our security solutions include SSL certificates, malware removal, and regular security audits.",
        "We can implement advanced security measures to protect your website from hacking and data breaches.",
        "Our team provides secure hosting options and continuous monitoring to ensure your site's safety.",
        "We offer a range of security services to safeguard your website and ensure data protection."
      ]
    },
    {
      "tag": "analytics",
      "patterns": [
        "Do you provide website analytics?",
        "Can you set up Google Analytics?",
        "Do you offer analytics services?",
        "Can you track my site's performance?",
        "What analytics tools do you use?",
        "Do you offer traffic analysis?",
        "Can you help with conversion tracking?",
        "Do you provide SEO analytics?",
        "Can you monitor user behavior?",
        "Do you offer detailed reports?",
        "Can you analyze my website's traffic?",
        "What analytics services do you offer?",
        "Can you provide insights on site performance?",
        "Do you use analytics for optimization?",
        "Can you track user interactions on my site?"
      ],
      "responses": [
        "Yes, we provide comprehensive website analytics services to track and analyze your site's performance.",
        "We can set up Google Analytics and other tools to monitor traffic, user behavior, and conversions.",
        "Our analytics services include detailed reports and insights to help you optimize your website.",
        "We offer traffic analysis, conversion tracking, and SEO analytics to enhance your online presence.",
        "Our team uses advanced analytics tools to provide a clear understanding of your website's performance and user interactions."
      ]
    },
    {
      "tag": "domain_hosting",
      "patterns": [
        "Do you offer domain and hosting services?",
        "Can you help with domain registration?",
        "Do you provide web hosting?",
        "Can you host my website?",
        "What hosting services do you offer?",
        "Can you manage my domain?",
        "Do you offer dedicated hosting?",
        "Can you help with DNS setup?",
        "Do you provide domain transfer services?",
        "What are your hosting options?",
        "Do you offer cloud hosting?",
        "Can you set up email hosting?",
        "Do you provide managed hosting?",
        "Can you recommend hosting solutions?",
        "Do you offer SSL certificates with hosting?"
      ],
      "responses": [
        "Yes, we offer comprehensive domain and hosting services, including domain registration and web hosting.",
        "We provide various hosting options, including shared, dedicated, and cloud hosting solutions.",
        "Our services include domain management, DNS setup, and SSL certificate installation.",
        "We can help you with domain transfers, email hosting, and managed hosting solutions.",
        "Our team offers reliable hosting services to ensure your website is secure and always online."
      ]
    },
    {
      "tag": "custom_functionality",
      "patterns": [
        "Can you add custom functionality to my website?",
        "Do you offer custom development?",
        "Can you build custom features?",
        "What custom solutions do you provide?",
        "Do you develop custom web applications?",
        "Can you integrate third-party APIs?",
        "Do you offer bespoke functionality?",
        "Can you create custom plugins?",
        "Do you develop tailored solutions?",
        "Can you build specific features for my site?",
        "What are your custom development services?",
        "Can you enhance my site with custom code?",
        "Do you offer unique functionality?",
        "Can you create custom integrations?",
        "Do you develop custom tools?"
      ],
      "responses": [
        "Yes, we offer custom development services to add unique functionality and features to your website.",
        "We can build bespoke web applications and custom solutions tailored to your specific needs.",
        "Our team is skilled in developing custom features, plugins, and integrations for your site.",
        "We offer tailored development services to enhance your website with custom code and unique functionality.",
        "Our custom development solutions ensure that your website meets all your specific requirements and business goals."
      ]
    },
    {
      "tag": "accessibility",
      "patterns": [
        "Do you offer website accessibility services?",
        "Can you make my site accessible?",
        "What accessibility solutions do you provide?",
        "Do you ensure ADA compliance?",
        "Can you improve my site's accessibility?",
        "Do you offer WCAG compliance services?",
        "Can you help with accessibility audits?",
        "What are your accessibility services?",
        "Do you provide accessible design?",
        "Can you ensure my site is usable by everyone?",
        "What is website accessibility?",
        "Do you offer inclusive design?",
        "Can you help with accessibility guidelines?",
        "Do you provide accessibility training?",
        "What accessibility tools do you use?"
      ],
      "responses": [
        "Yes, we offer comprehensive website accessibility services to ensure your site is usable by everyone.",
        "We can help improve your site's accessibility and ensure compliance with ADA and WCAG guidelines.",
        "Our accessibility solutions include audits, accessible design, and implementation of accessibility features.",
        "We provide training and guidelines to help you maintain an accessible website.",
        "Our team uses advanced tools and techniques to ensure your site meets all accessibility standards."
      ]
    },
    {
      "tag": "integration",
      "patterns": [
        "Can you integrate third-party services?",
        "Do you offer API integration?",
        "Can you connect my site to external services?",
        "What integration services do you provide?",
        "Can you integrate CRM systems?",
        "Do you offer social media integration?",
        "Can you connect payment gateways?",
        "Do you provide email marketing integration?",
        "Can you integrate analytics tools?",
        "Do you offer ERP integration?",
        "Can you connect my site to other platforms?",
        "What are your integration solutions?",
        "Can you help with software integration?",
        "Do you provide API development?",
        "Can you set up third-party integrations?"
      ],
      "responses": [
        "Yes, we offer comprehensive integration services, including API development and third-party service connections.",
        "We can integrate various external services like CRM systems, payment gateways, and social media platforms.",
        "Our integration solutions ensure seamless connectivity between your website and other tools or platforms you use.",
        "We provide custom API integration and development to enhance your website's functionality.",
        "Our team can help set up and manage third-party integrations to streamline your business operations."
      ]
    },
    {
      "tag": "maintenance_support",
      "patterns": [
        "Do you offer website maintenance?",
        "Can you provide ongoing support?",
        "What maintenance services do you provide?",
        "Do you offer site updates?",
        "Can you help with site backups?",
        "Do you provide technical support?",
        "What are your support options?",
        "Can you monitor my website?",
        "Do you offer emergency support?",
        "What is your maintenance plan?",
        "Do you provide content updates?",
        "Can you help with security updates?",
        "Do you offer performance monitoring?",
        "What is included in your support services?",
        "Can you assist with troubleshooting?"
      ],
      "responses": [
        "Yes, we offer comprehensive website maintenance and support services to ensure your site remains up-to-date and secure.",
        "Our maintenance services include regular updates, backups, and performance monitoring.",
        "We provide ongoing technical support to address any issues and ensure your website runs smoothly.",
        "Our maintenance plans cover content updates, security patches, and emergency support.",
        "We offer various support options to meet your specific needs and keep your website in optimal condition."
      ]
    }
  ]
}
